{"keras_version": "2.1.4", "config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "trainable": true, "name": "gru_1", "batch_input_shape": [null, 5, 1], "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "tanh", "stateful": false, "dropout": 0.0, "unroll": false, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "recurrent_constraint": null, "implementation": 1, "kernel_constraint": null, "recurrent_regularizer": null, "units": 200, "go_backwards": false, "use_bias": true, "return_state": false}, "class_name": "GRU"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}